# Добавление элемента
from Sets_in_Python.Low_level_set import my_list

my_set = {1, 2, 3, 4, 5}
my_set.add(6)
print(my_set)

# Добавление нескольких элементов
# Пример с добавлением элементов из списка
my_set = {1, 2, 3, 4, 5, 6, 7}
my_set.update([8, 9, 10])
print(my_set)

# Пример с добавлением элементов из кортежа
my_set = {1, 2}
my_set.update((3, 4, 5))
print(my_set)

# Пример с добавлением элементов из строки
my_set = {'a', 'b', 'c'}
my_set.update('def')
print(my_set)

# Добавление элементов из другого множества
my_set_0 = {1, 2, 3}
my_set_1 = {4, 5, 6}
my_set_0.update(my_set_1)
print(my_set_0)

#--------------------------------------------------
# Практическое применение
# Вот несколько хороших
# практических примеров использования множеств в реальной жизни.
#--------------------------------------------------
# Удаление дубликатов
my_list_set = [1, 2, 3, 30, 30, 4, 4, 5, 9, 5, 78, 8]
my_set = set(my_list_set)
print(my_set)

# Объединение данных
set_1 = {'I', 'Love'}
set_2 = {'Coding', 'in'}
set_3 = {'Python', '!!!'}

comb_set = set_1 | set_2 | set_3
print(comb_set)